In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
index = ['Linha_' + str(i) for i in range(5)]
index

['Linha_0', 'Linha_1', 'Linha_2', 'Linha_3', 'Linha_4']

In [4]:
s = pd.Series(data = data, index = index)
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

In [5]:
data = {"Linha_" + str(i): i + 1 for i in range(5)}
data

{'Linha_0': 1, 'Linha_1': 2, 'Linha_2': 3, 'Linha_3': 4, 'Linha_4': 5}

In [6]:
s = pd.Series(data)
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

In [7]:
s1 = s + 2
s1

Linha_0    3
Linha_1    4
Linha_2    5
Linha_3    6
Linha_4    7
dtype: int64

In [8]:
s2 = s + s1
s2

Linha_0     4
Linha_1     6
Linha_2     8
Linha_3    10
Linha_4    12
dtype: int64

# DataFrame

In [9]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [10]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
index = ["Linha_" + str(i) for i in range(3)]
index

['Linha_0', 'Linha_1', 'Linha_2']

In [12]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha_0  1  2  3
Linha_1  4  5  6
Linha_2  7  8  9

In [13]:
columns = ["Coluna_" + str(i) for i in range(3)]
columns

['Coluna_0', 'Coluna_1', 'Coluna_2']

In [14]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [15]:
data = {"Coluna_0": {"Linha_0": 1, "Linha_1": 4, "Linha_2": 7},
       "Coluna_1": {"Linha_0": 2, "Linha_1": 5, "Linha_2": 8},
       "Coluna_2": {"Linha_0": 3, "Linha_1": 6, "Linha_2": 9}}
df2 = pd.DataFrame(data)
df2

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [16]:
data = [(1, 2, 3),
       (4, 5, 6),
       (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [17]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [18]:
df1[df1 > 0] = "A"
df1

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A

In [19]:
df2[df2 > 0] = "B"
df2

        Coluna_0 Coluna_1 Coluna_2
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B

In [20]:
df3[df3 > 0] = "C"
df3

        Coluna_0 Coluna_1 Coluna_2
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

In [21]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

In [22]:
df5 = pd.concat([df1, df2, df3], axis = 1)
df5

,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2
Linha_0,A,A,A,B,B,B,C,C,C
Linha_1,A,A,A,B,B,B,C,C,C
Linha_2,A,A,A,B,B,B,C,C,C